using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAD2.Solutions
{
    public class NineteenthSolutionReflection
    {
        // Я правильно понял наследование подтипов и расширения - мои примеры с животными и смартфоном соответствуют логике эталонного решения.
        // Однако с наследованием с ограничением у меня ошибка: я просто изменил параметр массы, а нужно было показать, что класс 
        // теряет какие-то возможности или методы базового класса.Например, правильнее было бы: электромобиль не может заправляться 
        // бензином или подводная лодка не может долго плавать по поверхности. В целом две концепции из трёх поняты верно, но 
        // пример с ограничением нужно переделать.
    }
}
