using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAD2.Solutions
{
    public class NineteenthSolution
    {
        // Наследование подтипов
        // Есть общий класс "Животное", от него наследуются "Собака", "Кошка", "Птица". Это просто разные виды животных, каждый со своими особенностями.

        // Наследование с ограничением
        // Берём класс "Автомобиль" - от него "Легковой автомобиль". Просто ограничиваем массу до 3,5 тонн, и всё.

        // Наследование с расширением
        // Есть обычный "Телефон" - можно звонить и принимать звонки.
        // Делаем "Смартфон" - теперь можно ещё в интернет выходить, приложения ставить, фотки делать.
        // То есть добавили кучу нового, чего у обычного телефона не было.
    }
}
