using System;
using System.Collections.Generic;
using System.Data;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAD2.Solutions
{
    public class SeventeenthSolutionReflection
    {

        // Я сравнил своё решение с решением преподавателя. Оба моих примера (сотрудник с ролью и пользователь с подпиской) правильные и хорошо объяснены,
        // но они слишком похожи друг на друга — оба показывают одну и ту же идею: когда тип может меняться во время работы программы, нужно использовать
        // композицию. В эталонном решении намного больше разных ситуаций: не только изменяемость атрибутов, но и случаи, когда один компонент нужно
        // переиспользовать в разных классах (например, магические способности для героев и монстров, или статусы оружия для клинков и стрел).
        // В нём также показано, что иногда выбор между наследованием и композицией неоднозначен и зависит от конкретного проекта. 
        // Мне стоило добавить более разнообразные примеры.
    }
}
