namespace OOAD2.Solutions;

public class ThirdSolutionReflection
{
    // В своем решении по C# я подробно рассказал, как в C# все устроено с модулями - от простых 
    // классов до целых библиотек, которые можно качать и подключать. Как мне кажется после моего 
    // объяснения можно понять, как в C# организуется код и как его переиспользовать.
    // Про Python написано коротко, но по делу. Про модули и пакеты рассказано, как импортировать показано.
    // А вот с Java совсем скупо получилось. Упомянул пару слов про пакеты и все. 
    // Формально про модульность упомянули, но толком ничего не объяснено.
}