using static System.Net.WebRequestMethods;

namespace OOAD2.Solutions;

public class TwentiethSolutionReflection
{
    //  Моё решение на C# правильно реализует все три вида наследования. Для структурного наследования я использовал интерфейс ISearchable,
    //  который добавляет документу возможность поиска. Для наследования вариаций я показал роботов, которые по-разному двигаются,
    //  причём SwimmingRobot имеет и переопределённый метод Move() и перегруженную версию Move(int speed). Для конкретизации
    //  я сделал абстрактный класс Operation с наследниками Addition и Multiplication.
    //  Решения других студентов используют более сложные примеры из реальной практики. В Java показаны газовые плиты с электроподжигом,
    //  HTTPS-запросы с криптографией и другой пример реалзиации математических операций.
    //  В Python использованы примеры с API и загрузкой файлов. Главное отличие в том, что моё решение понятнее и проще для восприятия.    
    //  Примеры с роботами и математическими операциями сразу ясны, не нужно разбираться в деталях HTTP-протокола или криптографии.
    //  Но решения других студентов показывают, как наследование применяется в реальных программах, а не в учебных примерах.
}


