using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace OOAD2.Solutions
{
    public class TwentyThirdSolutionReflection
    {
        //  Моё решение со счётом и вкладом значительно лучше для объяснения принципа Лисков .Оно понятнее всех трёх предложенных примеров,
        //  показывает обе проблемы (усиление предусловий и ослабление постусловий) и главное — даёт правильное решение через комиссию. 
        //  Пример с термометрами проще, но показывает только предусловия. Пример с Car/Toyota похож по структуре, но менее интуитивен,
        //  а различие "топливо vs бензин" спорно.Пример с артефактами излишне сложен и запутан даже по признанию автора.
    }
}
